[
    {
        "title": "Welcome to Backtrack",
        "imageNames": ["globeFrame3", "globeFrame4", "globeFrame5", "globeFrame6", "globeFrame7", "globeFrame8", "globeFrame9", "globeFrame10", "globeFrame11", "globeFrame12", "globeFrame13", "globeFrame14", "globeFrame15", "globeFrame16", "globeFrame17", "globeFrame18", "globeFrame19", "globeFrame20", "globeFrame21", "globeFrame22", "globeFrame23", "globeFrame24", "globeFrame25", "globeFrame26", "globeFrame27", "globeFrame28", "globeFrame29", "globeFrame30", "globeFrame31", "globeFrame32", "globeFrame33"],
        "duration": 5.0,
        "id": 0,
        "nextId": 1,
        "button": "Get Started",
        "body": "Backtrack is a privacy-centric, open-source location logging solution that provides you with a history of location data for your device.  Backtrack provides an alternative to “Location History” features offered by many web mapping platforms, without selling your data or even sharing it with any third party.  Pausing and resuming your location history is just one tap away, and you can view all of your collected data right in the app."
    },
    {
        "title": "First Things First",
        "imageNames": ["arrowFrame1"],
        "duration": 5.0,
        "id": 1,
        "nextId": 2,
        "button": "Permissions All Set!",
        "body": "First, let’s get your permissions set up.  Open the Settings app using the link below.  Scroll down to “Backtrack”.  Tap on “Location”.  Choose “Always” so that Backtrack can access your location in the background.  This data is never shared with any third party, including the app developer.  Once you finish setup, you’ll be able to choose whether this data gets logged on your device storage or your private iCloud Drive."
    },
    {
        "title": "Let's Get Started",
        "imageNames": ["pinsFrame2", "pinsFrame2", "pinsFrame2", "pinsFrame3", "pinsFrame4", "pinsFrame5", "pinsFrame6", "pinsFrame7", "pinsFrame8", "pinsFrame9", "pinsFrame10", "pinsFrame11", "pinsFrame12", "pinsFrame13", "pinsFrame14", "pinsFrame15", "pinsFrame16", "pinsFrame17", "pinsFrame18", "pinsFrame18", "pinsFrame18"],
        "duration": 4.0,
        "id": 2,
        "nextId": -1,
        "button": "Get Backtracking!",
        "body": "Now that Backtrack is ready, you can dial in your preferred settings and start logging your adventures.  Tap the “i” icons for more details about each option.  To start/pause location logging, simply tap the \"Backtracking\" button!  Your location data is directly saved to a file named “backtrack.csv” in your device’s storage, or your private iCloud Drive."
    },
    {
        "title": "What is the Distance Filter?",
        "imageNames": ["distanceFrame2", "distanceFrame3", "distanceFrame4"],
        "duration": 3.0,
        "id": 3,
        "nextId": -1,
        "button": "",
        "body": "Adjusting this option changes how far your device has to travel before iOS will deliver a new location to Backtrack.  For example, if your device is traveling with a distance filter of 200m, Backtrack will receive and log GPS coordinates that are 200m apart.  Set this value to be smaller for greater precision, and larger for more coarse-grained tracking, and lower battery usage."
    },
    {
        "title": "What is iCloud Drive Logging?",
        "imageNames": ["icloudFrame", "icloudFrame", "icloudFrame1", "icloudFrame2", "icloudFrame3", "icloudFrame4", "icloudFrame5", "icloudFrame6", "icloudFrame7", "icloudFrame8", "icloudFrame9", "icloudFrame10", "icloudFrame11", "icloudFrame11", "icloudFrame11", "icloudFrame11", "icloudFrame11", "icloudFrame11", "icloudFrame11"],
        "duration": 2.0,
        "id": 4,
        "nextId": -1,
        "button": "",
        "body": "If you’re signed into iCloud on this device, turning this option ON will log your data to a file named “backtrack.csv” in your private iCloud Drive.  This data is not shared with any third party, and only accessible through your personal Apple ID.  If this option is OFF, Backtrack will log your data to a file named “backtrack.csv” on your device’s physical, local storage."
    },
    {
        "title": "Backtrack",
        "imageNames": ["globeFrame3"],
        "duration": 5.0,
        "id": 5,
        "nextId": -1,
        "button": "",
        "body": "Suscipit inceptos est felis purus aenean aliquet adipiscing diam venenatis, augue nibh duis neque aliquam tellus condimentum sagittis vivamus, cras ante etiam sit conubia elit tempus accumsan libero, mattis per erat habitasse cubilia ligula penatibus curae. Sagittis lorem augue arcu blandit libero molestie non ullamcorper, finibus imperdiet iaculis ad quam per luctus neque, ligula curae mauris parturient diam auctor eleifend laoreet ridiculus, hendrerit adipiscing sociosqu pretium nec velit aliquam."
    }
]
